#include "dk_hal.h"

/**********************************************************
函数名称：BeepOn
函数功能：蜂鸣器响
**********************************************************/
void BeepOn(void)
{

 CCPR1L  = 0xC0;		//占空比
 CCP1CON = 0b00001100;	//PWM 模式
 TMR2ON  = 1;			//有效
}

/**********************************************************
函数名称：BeepOff
函数功能：蜂鸣器关闭
**********************************************************/
void BeepOff(void)
{
 CCP1CON = 0b00000000;	//
 TMR2ON  = 0;			//有效
 Buzzer  = 0;
}

/**********************************************************
函数名称：BeepInd
函数功能：蜂鸣器响
**********************************************************/
void BeepInd(byte cnt)
{
 for(;cnt!=0;cnt--)
 	{	
 	BeepOn();
 	for(SysTime=0;SysTime<16;);	//延时
 	BeepOff();
	for(SysTime=0;SysTime<16;);	//延时
	}
}

